example/query/Poll_event_sensor_specific/EQ_value_uom.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:query="urn:epcglobal:epcis-query:xsd:1" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header/>
    <soapenv:Body>
        <query:Poll>
            <queryName>SimpleEventQuery</queryName>
            <params>
                <param>
                    <!-- EQ, GE, or LT -->
                    <!-- One of unit of sensor measure -->
                    <name>EQ_value_FAH</name>
                    <value xsi:type="xsd:double">78.8</value>
                    <!--
                    <name>EQ_value_CEL</name>
                    <value xsi:type="xsd:double">26</value>
                    -->
                </param>
            </params>
        </query:Poll>
    </soapenv:Body>
</soapenv:Envelope>